InformationRegisters/КлиентыСтационара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КлиентыСтационара</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КойкоМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КойкоМеста</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выписан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПоступления</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановкаУсловийПребывания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПланыЛечения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПланыЛечения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>удалитьДокументРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПриемовВДень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дозировка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗубВКарте</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомЗубыКарты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СегментВЗубе</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомСегментыЗубов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Конструкция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомКонструкцииЗубовКлиентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПервичныйПрием</Name>
					<Comment>Документ, созданный первым в рамках одного обращения пациента</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПервичныйПрием</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЭлемента</Name>
					<Comment>Собственный идентификатор элемента плана лечения</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЭлемента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНазначений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СправочникМеждународныхНепатентованныхНаименований</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.КатегорииВыработки</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПорядокЭлемента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ВыполнениеДействийСтационара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ВыполнениеДействийСтационара</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеРежима</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДействиеСтационара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СправочникМеждународныхНепатентованныхНаименований</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ДействияМедсестрыСтационара</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЭлемента</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВремяВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоВечер</Name>
					<Comment>Для параметров Температурного листа определяет, утренний это или вечерний замер показателя</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДополнительнаяИнформацияПоКлиентам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ДополнительнаяИнформацияПоКлиентам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыДействийСтационара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыДействийСтационара</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Процедуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Манипуляции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Медикаменты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ИсполнителиВСтационаре.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИсполнителиВСтационаре</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыполняетсяВрачом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполняетсяМедсестрой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполняетсяВрачомОтображается</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыНазначений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыНазначений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Обследование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Процедура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прием</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Медикаменты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийАнализов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОперацийАнализов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Забор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтметкаВыполненияИсследования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВСтороннююЛабораторию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеРезультатовОтСтороннейЛаборатории</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПробИзСтороннейЛаборатории</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаРезультатов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утеря</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеАнализа</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ДействияМедсестрыСтационара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ДействияМедсестрыСтационара</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполнениеВводомЗначения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазовоеЗначениеДиаграммы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonForms/АРМПалатнойМедсестры/Ext/Form/Module.bsl
&НаКлиенте
Перем мНеАктивизироватьСтроку;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Изменено Макеев 02-12-2025
	ПериодичностьАвтообновленияНазначений = УправлениеНастройкамиМедицинскогоУчета.ПолучитьПараметрУчетнойПолитики("Стационар_ПериодичностьАвтообновленияАРМПалатной");
	
	ВосстановитьНастройкиФормы();
	ДатаПросмотра = ТекущаяДата();
	
	Филиал = УправлениеНастройками.ПолучитьФилиалПоУмолчаниюПользователя();
	
	Если Не ЗначениеЗаполнено(СкладСписания) Тогда
		СкладСписания = УправлениеНастройками.ПолучитьЗначениеСотрудникаПоУмолчанию(ПараметрыСеанса.ТекущийПользователь.Сотрудник,"ОсновнойСкладМатериалов");
		Если Не ЗначениеЗаполнено(СкладСписания) Тогда
			УправлениеНастройками.ПолучитьЗначениеСотрудникаПоУмолчанию(ПараметрыСеанса.ТекущийПользователь.Сотрудник,"ОсновнойСкладТоваров");
		КонецЕсли;
	КонецЕсли;
	
	НастроитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Изменено Макеев 02-12-2025 (
	ЗаполнитьСписокДействий();
	мНеАктивизироватьСтроку = Ложь;
	
	Если ПериодичностьАвтообновленияНазначений > 0 Тогда
		ПодключитьОбработчикОжидания("ОбновитьНазначенияОбработчикОжидания", ПериодичностьАвтообновленияНазначений * 60);
	КонецЕсли;
	
	ОбновитьНазначенияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, СтандартнаяОбработка)
	
	Если Не ЗавершениеРаботы Тогда
		
		НастройкиФормы = Новый Структура;
		НастройкиФормы.Вставить("СкладСписания", СкладСписания);
		
		СохранитьНастройкиФормы(НастройкиФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ScanData" Тогда
		Если ВводДоступен() Тогда
			ТипШК = Неопределено;
			РаботаСТорговымОборудованиемКлиент.ОбработатьСобытиеСШКФормы(ЭтаФорма, Параметр, ТипШК);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Документ.ДействияНадАнализами.Форма.ФормаДокумента" Тогда
		Для Каждого Значение Из ВыбранноеЗначение Цикл
			ПараметрыОтбора = Новый Структура("Пациент, ДействиеСтационара", Значение.Клиент, Значение.Номенклатура);
			СтрокиДействий = СписокДействий.НайтиСтроки(ПараметрыОтбора);
			Для Каждого СтрокаДейтсвия Из СтрокиДействий Цикл
				ОбработкаВыполненияДействия(СтрокаДейтсвия);	
			КонецЦикла;  	
		КонецЦикла; 	
	КонецЕсли; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьНастройкиФормы(НастройкиФормы)
	
	Для Каждого Настройка Из НастройкиФормы Цикл
		ХранилищеПользовательскихНастроекОтчетов.Сохранить("ФормаАРМПалатнойМедсестры", Настройка.Ключ, 
															Настройка.Значение);
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройкиФормы()
	
	СкладСписания = ХранилищеПользовательскихНастроекОтчетов.Загрузить("ФормаАРМПалатнойМедсестры", "СкладСписания");
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПросмотраПриИзменении(Элемент)

	мНеАктивизироватьСтроку = Истина;
	
	Если Элементы.СписокПациентов.ТекущиеДанные <> Неопределено Тогда
		ТекущийПациент = Элементы.СписокПациентов.ТекущиеДанные.Пациент;
	КонецЕсли;
	
	СписокПациентов.Очистить();
	СписокДействийКэш.Очистить();
	СписокДействий.Очистить();
	
	ПриИзмененииДатаПросмотра();
	
	Если ЗначениеЗаполнено(ТекущийПациент) Тогда
		мсСтр = СписокПациентов.НайтиСтроки(Новый Структура("Пациент", ТекущийПациент));
		Если мсСтр.Количество() <> 0 Тогда 
			Элементы.СписокПациентов.ТекущаяСтрока = мсСтр[0].ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;
	
	мНеАктивизироватьСтроку = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииДатаПросмотра()
	
	ОбновитьНазначенияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПросмотраРегулирование(Элемент, Направление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДатаПросмотра = ДатаПросмотра + Направление * 86400;
	ДатаПросмотраПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ДатаПросмотраОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДатаПросмотра = ТекущаяДата();
	ДатаПросмотраПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьПоПациентам(Команда)
	
	Элементы.ПоказыватьПоПациентам.Пометка = Не Элементы.ПоказыватьПоПациентам.Пометка;
	ОбщегоНазначенияСервер.НастройкиВХранилище("АРММедсестры", "ПоказыватьПоПациентам", Элементы.ПоказыватьПоПациентам.Пометка);
	Элементы.ГруппаПациенты.Видимость = Элементы.ПоказыватьПоПациентам.Пометка;	
	Элементы.ГруппаИнформацияПациента.Видимость = Элементы.ПоказыватьПоПациентам.Пометка;	
	Элементы.СписокДействийПациент.Видимость = Не Элементы.ПоказыватьПоПациентам.Пометка;	
	Элементы.СписокДействийМедицинскаяКарта.Видимость = Не Элементы.ПоказыватьПоПациентам.Пометка;	
	
	ПоказыватьПоПациентам = Элементы.ПоказыватьПоПациентам.Пометка;
	Если Не ПоказыватьПоПациентам Тогда 
		Пациент = Неопределено;
	Иначе 
		ЗаполнитьСписокПациентов();
	КонецЕсли;
	ЗаполнитьСписокДействий();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьЭлементов()

	ПоказыватьПоПациентам = ОбщегоНазначенияСервер.НастройкиИзХранилища("АРММедсестры", "ПоказыватьПоПациентам");
	ПоказыватьПоПациентам = ?(ПоказыватьПоПациентам = Неопределено, Ложь, ПоказыватьПоПациентам);

	Элементы.ПоказыватьПоПациентам.Пометка = ПоказыватьПоПациентам;
	Элементы.ГруппаПациенты.Видимость = ПоказыватьПоПациентам;	
	Элементы.ГруппаИнформацияПациента.Видимость = ПоказыватьПоПациентам;	
	Элементы.СписокДействийПациент.Видимость = Не ПоказыватьПоПациентам;	
	Элементы.СписокДействийМедицинскаяКарта.Видимость = Не ПоказыватьПоПациентам;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокДействий()
	
	Если СписокДействийКэш.Количество() > 0 Тогда 
		
		ЗаполнитьСтруктуруОтбора();
		ЗаполнитьСтрокуСортировки();
		
		Если СтрДлина(СтрокаСортировки) > 0 Тогда 
			СписокДействийКэш.Сортировать(СтрокаСортировки);
		КонецЕсли;
		
		Если СтруктураОтбора.Количество() > 0 Тогда  
			СтрокиПоОтбору = СписокДействийКэш.НайтиСтроки(СтруктураОтбора);
		Иначе 
			СтрокиПоОтбору = СписокДействийКэш.Выгрузить();
		КонецЕсли;
		
		СписокДействий.Очистить();
		Если СтрокиПоОтбору.Количество() > 0 Тогда
			Для Каждого стрОтбора Из СтрокиПоОтбору Цикл 
				ЗаполнитьЗначенияСвойств( СписокДействий.Добавить(),стрОтбора);
			КонецЦикла;
		КонецЕсли;
		СписокДействий.Сортировать("ДействиеСтационара");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПациентовПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено 
		И ЗначениеЗаполнено(ТекущиеДанные.Пациент)
		И Не мНеАктивизироватьСтроку
	Тогда 
		
		Пациент = ТекущиеДанные.Пациент;
		ДанныеПоПациенту = СписокПациентов.НайтиСтроки(Новый Структура("Пациент",Пациент));
		
		Если ДанныеПоПациенту.Количество() > 0 Тогда 
			
			МедицинскаяКарта	= ДанныеПоПациенту[0].МедицинскаяКарта;
			ДатаРождения 		= Формат(ДанныеПоПациенту[0].ДатаРождения,"ДФ=dd.MM.yyyy");
			ДиагнозПоступления	= ДанныеПоПациенту[0].ДиагнозПоступления;
			ДатаПоступления 	= Формат(ДанныеПоПациенту[0].ДатаПоступления,"ДФ=dd.MM.yyyy");		
			
		КонецЕсли;
		КомментарийПоПациенту = ПолучитьКомментарийКлиента(Пациент);
		ПациентПриИзменении(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокПациентов()
	
	// Изменено Макеев 02-12-2025 (
	
	СписокПациентов.Очистить();
	
	ДополнительныеПоляЗапроса = Новый СписокЗначений;
	ДополнительныеПоляЗапроса.Добавить("Пациент", "Клиент");
	ДополнительныеПоляЗапроса.Добавить("ДатаРождения", "Клиент.ДатаРождения");
	ДополнительныеПоляЗапроса.Добавить("ДиагнозПоступления", "ДокументПоступления.ДокументОбращения.ДиагнозПоступления");
	ДополнительныеПоляЗапроса.Добавить("МедицинскаяКарта", "ДокументПоступления.ДокументОбращения.МедицинскаяКарта");
	
	ДополнительныеУсловия = Новый Массив;
	
	Если Не омг_Отделения.Количество() = 0 Тогда
		ТекстЗапроса = "КлиентыСтационара.КойкоМесто.Владелец.Подразделение В (&Подразделения)";
		ПараметрЗапроса = Новый Структура("Подразделения", омг_Отделения);
		ДополнительныеУсловия.Добавить(Новый Структура("Текст, Параметры", ТекстЗапроса, ПараметрЗапроса));
	КонецЕсли;
	
	Если Не омг_Филиалы.Количество() = 0 Тогда
		ТекстЗапроса = "Регистратор.Филиал В (&Филиалы)";
		ПараметрЗапроса = Новый Структура("Филиалы", омг_Филиалы);
		ДополнительныеУсловия.Добавить(Новый Структура("Текст, Параметры", ТекстЗапроса, ПараметрЗапроса));
	КонецЕсли;
	
	ТаблицаПациентов = Стационар.ПолучитьКлиентовСтационара(ДатаПросмотра, Филиал,ДополнительныеПоляЗапроса, ДополнительныеУсловия);
	
	Для Каждого СтрокаПациент Из ТаблицаПациентов Цикл
		
		ПациентСписка = СписокПациентов.Добавить();
		ЗаполнитьЗначенияСвойств(ПациентСписка, СтрокаПациент);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьДокументСписания(ДокументОснование, СписаниеТоваров)

	Если ЗначениеЗаполнено(СписаниеТоваров) Тогда
		ДокументСписания = СписаниеТоваров.ПолучитьОбъект();
	Иначе
		ДокументСписания = Документы.СписаниеТоваров.СоздатьДокумент();
	КонецЕсли;
	ДокументСписания.Товары.Очистить();
	ДокументСписания.Заполнить(ДокументОснование);
	Если ДокументСписания.Товары.Количество() = 0 Тогда
		ВызватьИсключение(НСтр("ru='В документе нет позиций для списания по складу.'"));
	КонецЕсли;

	ДокументСписания.Дата = ТекущаяДата();
	ДокументСписания.Филиал = ДокументОснование.Филиал;
	ДокументСписания.Ответственный = ОбщегоНазначения.ТекущийПользователь();
	
	ДокументСписания.Комментарий = НСтр("ru='Списание по документу " + ДокументОснование + "'");
	
	ДокументСписания.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат ДокументСписания.Ссылка;
	
КонецФункции	

&НаСервере
Функция ОтметитьВыполнениеНаСервере(СтруктураДанных)
	
	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
		
	// Создаем документ ДействияЗаСутки
	
	// Изменения Макеев 17-12-2025 (
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ДействияЗаСутки.Ссылка КАК Ссылка,
	                      |	ДействияЗаСутки.СписаниеТоваров КАК СписаниеТоваров
	                      |ИЗ
	                      |	Документ.ДействияЗаСутки КАК ДействияЗаСутки
	                      |ГДЕ
	                      |	НЕ ДействияЗаСутки.ПометкаУдаления
	                      |	И ДействияЗаСутки.Ответственный = &Ответственный
	                      |	И ДействияЗаСутки.Филиал = &Филиал
	                      |	И НАЧАЛОПЕРИОДА(ДействияЗаСутки.Дата, ДЕНЬ) = &Дата");
	Запрос.УстановитьПараметр("Филиал",Филиал);
	Запрос.УстановитьПараметр("Ответственный", ТекущийПользователь);
	Запрос.УстановитьПараметр("Дата", НачалоДня(ТекущаяДата()));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда 
		ДействияЗаСуткиОбъект = Документы.ДействияЗаСутки.СоздатьДокумент();
	
		ДействияЗаСуткиОбъект.Дата  		= ТекущаяДата();
		ДействияЗаСуткиОбъект.Филиал         = Филиал;
		ДействияЗаСуткиОбъект.Ответственный = ТекущийПользователь;
	Иначе 
		ДействияЗаСуткиОбъект = Выборка.Ссылка.ПолучитьОбъект();
	КонецЕсли;
	
	Если СтруктураДанных.Количество() > 0 Тогда 
		стрДействий = ДействияЗаСуткиОбъект.ДействияСтационара.Добавить();
	    ЗаполнитьЗначенияСвойств(стрДействий,СтруктураДанных);		
		// Изменения Макеев 13-12-2025 (
		стрДействий.Количество = СтруктураДанных.Значение;
		стрДействий.ДатаВремяВыполнения = ТекущаяДата();
		ДействияЗаСуткиОбъект.Склад = СтруктураДанных.Склад;
		Если ТипЗнч(стрДействий.ДействиеСтационара) = Тип("СправочникСсылка.Номенклатура")
			И РаботаСФормамиСервер.ЭтоМатериал(стрДействий.ДействиеСтационара)
			И Не ЗначениеЗаполнено(стрДействий.Коэффициент)
		Тогда
			стрДействий.Коэффициент = стрДействий.ЕдиницаИзмерения.Коэффициент;
		КонецЕсли;
	КонецЕсли;
	
	Попытка
		НачатьТранзакцию();
		ДействияЗаСуткиОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		СписаниеТоваров = СоздатьДокументСписания(ДействияЗаСуткиОбъект.Ссылка, ДействияЗаСуткиОбъект.СписаниеТоваров);
		
		Если Не ЗначениеЗаполнено(ДействияЗаСуткиОбъект.СписаниеТоваров) Тогда
			ДействияЗаСуткиОбъект.СписаниеТоваров = СписаниеТоваров;
			ДействияЗаСуткиОбъект.Записать();
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		Возврат Истина;
	Исключение
		ОтменитьТранзакцию();
		Возврат Ложь;			
	КонецПопытки;
		
КонецФункции

&НаКлиенте
Процедура Обработчик_ПослеОтветаНаВопросОВыполненииДействия(Ответ, ТекущиеДанные) Экспорт
	
	Если Не Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ОбработкаВыполненияДействия(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействие(Команда)
	
	ТекущиеДанные = Элементы.СписокДействий.ТекущиеДанные;	
	// Добавлено Макеев (
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ТипЗнч(ТекущиеДанные.ДействиеСтационара) = Тип("СправочникСсылка.Номенклатура")
		И Не РаботаСФормамиСервер.ЭтоМатериал(ТекущиеДанные.ДействиеСтационара) Тогда
		ТекстВопроса = "Выполнить действия по назначению?";
		ОписаниеОповещения = Новый ОписаниеОповещения("Обработчик_ПослеОтветаНаВопросОВыполненииДействия", ЭтаФорма, ТекущиеДанные);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да, "", КодВозвратаДиалога.Нет);
		Возврат;
	КонецЕсли;
	// )
	ОбработкаВыполненияДействия(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыполненияДействия(ТекущиеДанные)
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДатаПросмотра <> НачалоДня(ТекущаяДата()) Тогда
		
		Если Не ЭтоДействиеТемпературногоЛиста(ТекущиеДанные.ДействиеСтационара) Тогда 
			ТекстЗаголовка = НСтр("ru='Дата просмотра не совпадает с текущей датой!'");
			ТекстВопроса = НСтр("ru='Выполнение действия будет отмечено сегодняшним днём
			|и уменьшит требуемое количество выполнения за сегодня, а не за просматриваемый день.
			|Все равно выполнить отметку выполнения?'");
			Если Вопрос(ТекстВопроса, РежимДиалогаВопрос.ОКОтмена, 30, КодВозвратаДиалога.Отмена, ТекстЗаголовка, КодВозвратаДиалога.Отмена) = КодВозвратаДиалога.Отмена Тогда
				Возврат;
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для изменения даты фактического выполнения следует вручную внести изменения в документы ""Действия медсестры за сутки""");
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	СтруктураДанных = Новый Структура("Документ,ИдентификаторДействия,ДействиеСтационара",ТекущиеДанные.ДокументИзмененияРежима,ТекущиеДанные.ИдентификаторДействия,ТекущиеДанные.ДействиеСтационара);
	СтруктураДанных.Вставить("Склад",СкладСписания);
	СтруктураДанных.Вставить("Клиент", ТекущиеДанные.Пациент);
	СтруктураДанных.Вставить("МедицинскаяКарта",ТекущиеДанные.МедицинскаяКарта);
	СтруктураДанных.Вставить("ПервичныйПрием",ПолучитьПервичныйПрием(ТекущиеДанные.ДокументИзмененияРежима));
	СтруктураДанных.Вставить("ВидыДействийСтационара",ТекущиеДанные.ВидДействия);
	СтруктураДанных.Вставить("ИдентификаторЭлемента",Новый УникальныйИдентификатор(ТекущиеДанные.ИдентификаторДействия));
	СтруктураДанных.Вставить("Дозировка",ТекущиеДанные.Дозировка);
	СтруктураДанных.Вставить("Количество",1);
	СтруктураДанных.Вставить("Коэффициент",ТекущиеДанные.Коэффициент);
	СтруктураДанных.Вставить("ЕдиницаИзмерения",ТекущиеДанные.ЕдиницаИзмерения);
	СтруктураДанных.Вставить("ХарактеристикаНоменклатуры", Неопределено);
	
	Если ЭтоДействиеТемпературногоЛиста(ТекущиеДанные.ДействиеСтационара) Тогда 
		
		СтруктураДанных.Вставить("ДатаПросмотра", ДатаПросмотра);
		СтруктураОтбора = Новый Структура("Пациент, ВидДействия", ТекущиеДанные.Пациент, ПредопределенноеЗначение("Перечисление.ВидыДействийСтационара.Манипуляции"));	
		МсСтрокиДействияПациента = СписокДействий.НайтиСтроки(СтруктураОтбора);
		
		СоответствиеДействияСтационара = Новый Соответствие;
		Для каждого СтрокаДействияПациента Из МсСтрокиДействияПациента Цикл
			Если СоответствиеДействияСтационара.Получить(СтрокаДействияПациента.ДействиеСтационара) = Неопределено Тогда
				СоответствиеДействияСтационара.Вставить(СтрокаДействияПациента.ДействиеСтационара, 
																Новый Структура("ИдентификаторДействия, ДокументИзмененияРежима", 
																СтрокаДействияПациента.ИдентификаторДействия, СтрокаДействияПациента.ДокументИзмененияРежима));
			КонецЕсли;
		КонецЦикла;
		
		СтруктураДанных.Вставить("НазначенныеДействия", СоответствиеДействияСтационара);
		ФормаВводаЗначения = ПолучитьФорму("ОбщаяФорма.ТемпературныйЛистВводПоказателей", СтруктураДанных);
		ОткрытьФорму("ОбщаяФорма.ТемпературныйЛистВводПоказателей",СтруктураДанных,,,,, Новый ОписаниеОповещения("ОтметитьВыполнениеТЛНаСервере", ЭтаФорма, СтруктураДанных));	
	Иначе
	//Если Не ТекущиеДанные.ОтметкаВыполнения Тогда 
		Если ТекущиеДанные.ВыполнениеВводомЗначения Тогда 
			ПараметрыФормы = Новый Структура("ДействиеСтационара, ЕдиницаИзмерения, СкладСписания",ТекущиеДанные.ДействиеСтационара, ТекущиеДанные.ЕдиницаИзмерения, СкладСписания);
			ФормаВводаЗначения = ПолучитьФорму("ОбщаяФорма.ФормаПростановкиЗначения",ПараметрыФормы);
			ФормаВводаЗначения.Элементы.Значение.Заголовок = Строка(ТекущиеДанные.ДействиеСтационара);
			Значение = ФормаВводаЗначения.ОткрытьМодально();
			Если Значение = Неопределено Тогда
				// Отмена действия
				Возврат;
			КонецЕсли;
		Иначе 
			Если ТипЗнч(ТекущиеДанные.ДействиеСтационара) = Тип("СправочникСсылка.Номенклатура")
				И РаботаСФормамиСервер.ЭтоМатериал(ТекущиеДанные.ДействиеСтационара)
			Тогда 
				Если Не ЗначениеЗаполнено(СкладСписания) Тогда 
					ПоказатьПредупреждение(,"Выберите склад для проведения действий с лекарствами и другими товарно-материальными ценностями!", 30);
					Возврат;
				Иначе
					ПараметрыФормы = Новый Структура("Дозировка, ДействиеСтационара, ЕдиницаИзмерения, СкладСписания",ТекущиеДанные.Дозировка,ТекущиеДанные.ДействиеСтационара, ТекущиеДанные.ЕдиницаИзмерения, СкладСписания);
					ФормаВводаЗначения = ПолучитьФорму("ОбщаяФорма.ФормаПростановкиЗначения",ПараметрыФормы);
					ФормаВводаЗначения.Элементы.Значение.Заголовок = "Дозировка " + Строка(ТекущиеДанные.ДействиеСтационара);
					Значение = ФормаВводаЗначения.ОткрытьМодально();
					Если Значение = Неопределено Тогда
						// Отмена действия
						Возврат;
					ИначеЕсли ТипЗнч(Значение) = Тип("Структура") Тогда
						СтруктураДанных.Вставить("ХарактеристикаНоменклатуры", Значение.ХарактеристикаНоменклатуры);
						СтруктураДанных.Вставить("СерияНоменклатуры",		   Значение.СерияНоменклатуры);
						Значение = Значение.Значение;
					КонецЕсли;
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;
		СтруктураДанных.Вставить("Значение",Значение);
		Если ОтметитьВыполнениеНаСервере(СтруктураДанных) Тогда 
			// Изменено Макеев 18-12-2025 (
			ТекущиеДанные.Выполнено = ТекущиеДанные.Выполнено + 1;
			Если СтруктураДанных.ВидыДействийСтационара = ПредопределенноеЗначение("Перечисление.ВидыДействийСтационара.Медикаменты") Тогда
				ТекущиеДанные.омг_Введено = ТекущиеДанные.омг_Введено + Значение;
				ТекущиеДанные.Выполнено = Цел(ТекущиеДанные.РазВДень * (ТекущиеДанные.омг_Введено / (ТекущиеДанные.Дозировка * ТекущиеДанные.РазВДень)));
			КонецЕсли;
			СтрокаКЭШ = СписокДействийКэш.НайтиСтроки(Новый Структура("ИдентификаторДействия",ТекущиеДанные.ИдентификаторДействия));
			
			Если ДатаПросмотра = НачалоДня(ТекущаяДата()) Тогда
				ТекущиеДанные.ВыполненоИтог = Строка(ТекущиеДанные.Выполнено) + "/" + Строка(ТекущиеДанные.РазВДень);
			КонецЕсли;
			
			Если ТекущиеДанные.Выполнено >= ТекущиеДанные.РазВДень Тогда 
				ТекущиеДанные.ОтметкаВыполнения = Истина;
			КонецЕсли;
			
			Если СтрокаКЭШ.Количество() > 0 Тогда 
				СтрокаКЭШ[0].Выполнено = ТекущиеДанные.Выполнено;
				СтрокаКЭШ[0].ВыполненоИтог = ТекущиеДанные.ВыполненоИтог;
				СтрокаКЭШ[0].ОтметкаВыполнения = ТекущиеДанные.ОтметкаВыполнения;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокДействий(Команда)
	ЗаполнитьСписокДействий();
КонецПроцедуры

&НаКлиенте
Процедура ВидДействияПриИзменении(Элемент)
	ЗаполнитьСписокДействий();
КонецПроцедуры

#Область ЗаполнитьСписокДействийКЭШ

&НаСервере
Процедура ЗаполнитьСписокДействийКЭШ()
	
	// Изменено Макеев 18-12-2025 (
	СписокДействийКэш.Очистить();
	
	Медкарты = СписокПациентов.Выгрузить().ВыгрузитьКолонку("МедицинскаяКарта");
	
	// Сбор данных из базы
	НазначенныеДействияМедсестры = НазначенныеДействияМедсестрыПациентов(ДатаПросмотра, Медкарты, омг_Филиалы, омг_Отделения);
	ПланыЛечения = ПланыЛеченияПациентов(ДатаПросмотра, Медкарты, омг_Филиалы, омг_Отделения);
	ПланыЛечения.Колонки.Добавить("ВыполнениеВводомЗначения", Новый ОписаниеТипов("Булево"));
	
	ИдентификаторНазначений = НазначенныеДействияМедсестры.ВыгрузитьКолонку("ИдентификаторДействия");
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ИдентификаторНазначений, ПланыЛечения.ВыгрузитьКолонку("ИдентификаторДействия"));
	
	ВыполнениеНазначений = ВыполнениеНазначенийПациентов(ДатаПросмотра, ИдентификаторНазначений);
	
	// Наполнение кеша режимом
	Источники = ОбщегоНазначенияКлиентСервер.НовыйМассив(НазначенныеДействияМедсестры, ПланыЛечения);
	Для Каждого Источник Из Источники Цикл
		Для Каждого СтрокаНазначение Из Источник Цикл
			
			ВыполнениеНазначения = ВыполнениеНазначений.Найти(СтрокаНазначение.ИдентификаторДействия, "ИдентификаторЭлемента");
			Выполнено = ?(ВыполнениеНазначения = Неопределено, 0, ВыполнениеНазначения.Количество);
			
			новСтр = СписокДействийКэш.Добавить();
			ЗаполнитьЗначенияСвойств(новСтр, СтрокаНазначение);
			
			новСтр.Выполнено = Выполнено;
			Если СтрокаНазначение.ВидДействия = ПредопределенноеЗначение("Перечисление.ВидыДействийСтационара.Медикаменты") Тогда
				новСтр.Выполнено = Цел(СтрокаНазначение.РазВДень * (новСтр.омг_Введено / (СтрокаНазначение.Дозировка * СтрокаНазначение.РазВДень)));
			КонецЕсли;
			новСтр.ВыполненоИтог = Строка(новСтр.Выполнено) + "/" + Строка(новСтр.РазВДень);
			Если новСтр.Выполнено >= новСтр.РазВДень Тогда 
				новСтр.ОтметкаВыполнения = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НазначенныеДействияМедсестрыПациентов(ДатаПросмотра, Медкарты, Филиалы, Отделения)
	
	// Изменено Макеев 03-12-2025 (
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаПросмотра", ДатаПросмотра);
	Запрос.УстановитьПараметр("Медкарты", Медкарты);
	Запрос.УстановитьПараметр("ОтборПоФилиалам", Не Филиалы.Количество() = 0);
	Запрос.УстановитьПараметр("ОтборПоОтделениям", Не Отделения.Количество() = 0);
	Запрос.УстановитьПараметр("Филиалы", Филиалы);
	Запрос.УстановитьПараметр("Отделения", Отделения);
	Запрос.Текст = 			"ВЫБРАТЬ
	               			|	МАКСИМУМ(ИзменениеРежима.Ссылка) КАК Ссылка,
	               			|	ИзменениеРежима.МедицинскаяКарта КАК МедицинскаяКарта,
	               			|	ИзменениеРежима.Клиент КАК Клиент,
	               			|	КлиентыСтационараСрезПоследних.Подразделение КАК Отделение,
	               			|	КлиентыСтационараСрезПоследних.Подразделение.Филиал КАК Филиал
	               			|ПОМЕСТИТЬ ИзменениеРежима
	               			|ИЗ
	               			|	Документ.ИзменениеРежима КАК ИзменениеРежима
	               			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыСтационара.СрезПоследних(КОНЕЦПЕРИОДА(&ДатаПросмотра, ДЕНЬ), ) КАК КлиентыСтационараСрезПоследних
	               			|		ПО ИзменениеРежима.Клиент = КлиентыСтационараСрезПоследних.Клиент
	               			|			И (НЕ КлиентыСтационараСрезПоследних.Выписан)
	               			|ГДЕ
	               			|	ИзменениеРежима.МедицинскаяКарта В(&Медкарты)
	               			|	И ИзменениеРежима.Дата < КОНЕЦПЕРИОДА(&ДатаПросмотра, ДЕНЬ)
	               			|	И НЕ ИзменениеРежима.ПометкаУдаления
	               			|	И ВЫБОР
	               			|			КОГДА НЕ &ОтборПоОтделениям
	               			|				ТОГДА ИСТИНА
	               			|			ИНАЧЕ КлиентыСтационараСрезПоследних.Подразделение В (&Отделения)
	               			|		КОНЕЦ
	               			|	И ВЫБОР
	               			|			КОГДА НЕ &ОтборПоФилиалам
	               			|				ТОГДА ИСТИНА
	               			|			ИНАЧЕ КлиентыСтационараСрезПоследних.Подразделение.Филиал В (&Филиалы)
	               			|		КОНЕЦ
	               			|
	               			|СГРУППИРОВАТЬ ПО
	               			|	ИзменениеРежима.МедицинскаяКарта,
	               			|	ИзменениеРежима.Клиент,
	               			|	КлиентыСтационараСрезПоследних.Подразделение,
	               			|	КлиентыСтационараСрезПоследних.Подразделение.Филиал
	               			|;
	               			|
	               			|////////////////////////////////////////////////////////////////////////////////
	               			|ВЫБРАТЬ
	               			|	ИзменениеРежима.Клиент КАК Пациент,
	               			|	ИзменениеРежима.МедицинскаяКарта КАК МедицинскаяКарта,
	               			|	ИзменениеРежимаНазначения.ДействиеСтационара КАК ДействиеСтационара,
	               			|	ИзменениеРежимаНазначения.ДействиеСтационара.ВыполнениеВводомЗначения КАК ВыполнениеВводомЗначения,
	               			|	ИзменениеРежимаНазначения.ДатаНачала КАК ДатаНачала,
	               			|	ИзменениеРежимаНазначения.ДатаОкончания КАК ДатаОкончания,
	               			|	ВЫБОР
	               			|		КОГДА ЕСТЬNULL(ИзменениеРежимаНазначения.СколькоРазВДень, 0) = 0
	               			|			ТОГДА 1
	               			|		ИНАЧЕ ИзменениеРежимаНазначения.СколькоРазВДень
	               			|	КОНЕЦ КАК РазВДень,
	               			|	1 КАК Дозировка,
	               			|	ИзменениеРежимаНазначения.Комментарий КАК Комментарий,
	               			|	ИзменениеРежимаНазначения.Ссылка КАК ДокументИзмененияРежима,
	               			|	ИзменениеРежимаНазначения.ИдентификаторДействия КАК ИдентификаторДействия,
	               			|	ЗНАЧЕНИЕ(Перечисление.ВидыДействийСтационара.Манипуляции) КАК ВидДействия,
	               			|	ИзменениеРежима.Филиал КАК Филиал,
	               			|	ИзменениеРежима.Отделение КАК Отделение
	               			|ИЗ
	               			|	Документ.ИзменениеРежима.ДействияСтационара КАК ИзменениеРежимаНазначения
	               			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИзменениеРежима КАК ИзменениеРежима
	               			|		ПО ИзменениеРежимаНазначения.Ссылка = ИзменениеРежима.Ссылка
	               			|ГДЕ
	               			|	(ИзменениеРежимаНазначения.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1)
	               			|				И ИзменениеРежимаНазначения.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	               			|			ИЛИ ИзменениеРежимаНазначения.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1)
	               			|				И ИзменениеРежимаНазначения.ДатаОкончания >= НАЧАЛОПЕРИОДА(&ДатаПросмотра, ДЕНЬ)
	               			|			ИЛИ ИзменениеРежимаНазначения.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	               			|				И НАЧАЛОПЕРИОДА(ИзменениеРежимаНазначения.ДатаНачала, ДЕНЬ) <= НАЧАЛОПЕРИОДА(&ДатаПросмотра, ДЕНЬ)
	               			|			ИЛИ НАЧАЛОПЕРИОДА(&ДатаПросмотра, ДЕНЬ) МЕЖДУ ИзменениеРежимаНазначения.ДатаНачала И ИзменениеРежимаНазначения.ДатаОкончания)";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервереБезКонтекста
Функция ПланыЛеченияПациентов(ДатаПросмотра, Медкарты, Филиалы, Отделения)
	
	// Изменено Макеев 18-12-2025 (
	Запрос = Новый Запрос;
	
	пчИсполнители = Перечисления.ИсполнителиВСтационаре;
	ИсполнительНеДопустимый = ОбщегоНазначенияБИТКлиентСервер.НовыйМассив(пчИсполнители.ВыполняетсяВрачом, пчИсполнители.ПустаяСсылка());
	Запрос.УстановитьПараметр("ИсполнительНеДопустимый", ИсполнительНеДопустимый);
	Запрос.УстановитьПараметр("ДатаПросмотра", ДатаПросмотра);
	Запрос.УстановитьПараметр("Медкарты", Медкарты);
	Запрос.УстановитьПараметр("ОтборПоФилиалам", Не Филиалы.Количество() = 0);
	Запрос.УстановитьПараметр("ОтборПоОтделениям", Не Отделения.Количество() = 0);
	Запрос.УстановитьПараметр("Филиалы", Филиалы);
	Запрос.УстановитьПараметр("Отделения", Отделения);
	
	Запрос.Текст = 			"ВЫБРАТЬ
	               			|	ПланыЛечения.ПервичныйПрием.Клиент КАК Пациент,
	               			|	ПланыЛечения.ПервичныйПрием.МедицинскаяКарта КАК МедицинскаяКарта,
	               			|	ПланыЛечения.Комментарий КАК Комментарий,
	               			|	ПланыЛечения.ДокументРегистратор КАК ДокументИзмененияРежима,
	               			|	ПланыЛечения.Дата КАК ДатаНачала,
	               			|	ПланыЛечения.ДатаОкончания КАК ДатаОкончания,
	               			|	ПланыЛечения.Количество КАК ВсегоНазначено,
	               			|	ВЫБОР
	               			|		КОГДА ПланыЛечения.ВидЭлемента = ЗНАЧЕНИЕ(Перечисление.ВидыНазначений.Медикаменты)
	               			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДействийСтационара.Медикаменты)
	               			|		КОГДА ПланыЛечения.ВидЭлемента = ЗНАЧЕНИЕ(Перечисление.ВидыНазначений.Обследование)
	               			|				ИЛИ ПланыЛечения.ВидЭлемента = ЗНАЧЕНИЕ(Перечисление.ВидыНазначений.Процедура)
	               			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДействийСтационара.Процедуры)
	               			|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДействийСтационара.Процедуры)
	               			|	КОНЕЦ КАК ВидДействия,
	               			|	ПланыЛечения.ИдентификаторЭлемента КАК ИдентификаторДействия,
	               			|	ПланыЛечения.Номенклатура КАК ДействиеСтационара,
	               			|	ВЫБОР
	               			|		КОГДА ПланыЛечения.ПриемовВДень = 0
	               			|			ТОГДА 1
	               			|		ИНАЧЕ ПланыЛечения.ПриемовВДень
	               			|	КОНЕЦ КАК РазВДень,
	               			|	ПланыЛечения.Дозировка КАК Дозировка,
	               			|	ПланыЛечения.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               			|	ПланыЛечения.Коэффициент КАК Коэффициент,
	               			|	ЕСТЬNULL(ПланыЛечения.Номенклатура.ВестиУчетПоХарактеристикам, ЛОЖЬ) КАК ВестиУчетПоХарактеристикам,
	               			|	КлиентыСтационараСрезПоследних.Подразделение КАК Отделение,
	               			|	КлиентыСтационараСрезПоследних.Подразделение.Филиал КАК Филиал,
	               			|	ЕСТЬNULL(ВведенныеДозировки.Значение, 0) КАК омг_Введено,
	               			|	ПланыЛечения.Дозировка * ВЫБОР
	               			|		КОГДА ПланыЛечения.ПриемовВДень = 0
	               			|			ТОГДА 1
	               			|		ИНАЧЕ ПланыЛечения.ПриемовВДень
	               			|	КОНЕЦ КАК омг_ДозировкаОбщая
	               			|ИЗ
	               			|	РегистрСведений.ПланыЛечения КАК ПланыЛечения
	               			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыСтационара.СрезПоследних(КОНЕЦПЕРИОДА(&ДатаПросмотра, ДЕНЬ), ) КАК КлиентыСтационараСрезПоследних
	               			|		ПО ПланыЛечения.ПервичныйПрием.Клиент = КлиентыСтационараСрезПоследних.Клиент
	               			|			И (НЕ КлиентыСтационараСрезПоследних.Выписан)
	               			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               			|			ВыполнениеДействийСтационара.ИдентификаторЭлемента КАК ИдентификаторЭлемента,
	               			|			СУММА(ВыполнениеДействийСтационара.Значение) КАК Значение
	               			|		ИЗ
	               			|			РегистрСведений.ВыполнениеДействийСтационара КАК ВыполнениеДействийСтационара
	               			|		ГДЕ
	               			|			ВыполнениеДействийСтационара.Документ.МедицинскаяКарта В(&Медкарты)
	               			|		
	               			|		СГРУППИРОВАТЬ ПО
	               			|			ВыполнениеДействийСтационара.ИдентификаторЭлемента) КАК ВведенныеДозировки
	               			|		ПО ПланыЛечения.ИдентификаторЭлемента = ВведенныеДозировки.ИдентификаторЭлемента
	               			|ГДЕ
	               			|	ПланыЛечения.ПервичныйПрием ССЫЛКА Документ.Прием
	               			|	И ПланыЛечения.ПервичныйПрием.МедицинскаяКарта В(&Медкарты)
	               			|	И НЕ ПланыЛечения.Номенклатура.ИсполнительВСтационаре В (&ИсполнительНеДопустимый)
	               			|	И (ПланыЛечения.Дата = ДАТАВРЕМЯ(1, 1, 1)
	               			|				И (ПланыЛечения.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	               			|					ИЛИ ПланыЛечения.ДатаОкончания >= НАЧАЛОПЕРИОДА(&ДатаПросмотра, ДЕНЬ))
	               			|			ИЛИ ПланыЛечения.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	               			|				И НАЧАЛОПЕРИОДА(ПланыЛечения.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаПросмотра, ДЕНЬ)
	               			|			ИЛИ НАЧАЛОПЕРИОДА(&ДатаПросмотра, ДЕНЬ) МЕЖДУ ПланыЛечения.Дата И ПланыЛечения.ДатаОкончания)
	               			|	И ПланыЛечения.ДокументРегистратор.Проведен
	               			|	И ВЫБОР
	               			|			КОГДА НЕ &ОтборПоОтделениям
	               			|				ТОГДА ИСТИНА
	               			|			ИНАЧЕ КлиентыСтационараСрезПоследних.Подразделение В (&Отделения)
	               			|		КОНЕЦ
	               			|	И ВЫБОР
	               			|			КОГДА НЕ &ОтборПоФилиалам
	               			|				ТОГДА ИСТИНА
	               			|			ИНАЧЕ КлиентыСтационараСрезПоследних.Подразделение.Филиал В (&Филиалы)
	               			|		КОНЕЦ";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервереБезКонтекста
Функция ВыполнениеНазначенийПациентов(ДатаПросмотра, ИдентификаторыНазначений)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаПросмотра", ДатаПросмотра);
	Запрос.УстановитьПараметр("ИдентификаторыНазначений", ИдентификаторыНазначений);
	Запрос.Текст = 			"ВЫБРАТЬ
	                      	|	ВыполнениеДействийСтационара.ИдентификаторЭлемента КАК ИдентификаторЭлемента,
	                      	|	СУММА(ВыполнениеДействийСтационара.Количество) КАК Количество
	                      	|ИЗ
	                      	|	РегистрСведений.ВыполнениеДействийСтационара КАК ВыполнениеДействийСтационара
	                      	|ГДЕ
							|	ВыполнениеДействийСтационара.ИдентификаторЭлемента В (&ИдентификаторыНазначений)
	                      	|	И НАЧАЛОПЕРИОДА(ВыполнениеДействийСтационара.ДатаВремяВыполнения, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаПросмотра, ДЕНЬ)
	                      	|
	                      	|СГРУППИРОВАТЬ ПО
	                      	|	ВыполнениеДействийСтационара.ИдентификаторЭлемента
	                      	|";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
	
#КонецОбласти // ЗаполнитьСписокДействийКЭШ

// ЗаданияНаДень - Выборка из запроса.
&НаСервереБезКонтекста
Функция ОстаткиВыполненияНазначений(Дата, ЗаданияНаДень)
	
	// Отбираю те назначения, по которым можно проверить, не выполнено ли общее количество.
	ЗавершаемыеНазначения = Новый ТаблицаЗначений;
	ЗавершаемыеНазначения.Колонки.Добавить("ИдентификаторДействия");
	ЗавершаемыеНазначения.Колонки.Добавить("Пациент");
	ЗавершаемыеНазначения.Колонки.Добавить("ДокументИзмененияРежима");
	ЗавершаемыеНазначения.Колонки.Добавить("ВсегоНазначено", Новый ОписаниеТипов("Число"));
	ЗавершаемыеНазначения.Колонки.Добавить("ОстатосьВыполнить", Новый ОписаниеТипов("Число"));
	Пока ЗаданияНаДень.Следующий() Цикл
		Если ЗначениеЗаполнено(ЗаданияНаДень.ВсегоНазначено)
			И ЗначениеЗаполнено(ЗаданияНаДень.ИдентификаторДействия)
		Тогда
			ЗаполнитьЗначенияСвойств(ЗавершаемыеНазначения.Добавить(), ЗаданияНаДень);
		КонецЕсли;
	КонецЦикла;
	ЗавершаемыеНазначения.ЗагрузитьКолонку(ЗавершаемыеНазначения.ВыгрузитьКолонку("ВсегоНазначено"), "ОстатосьВыполнить");
	
	Если ЗавершаемыеНазначения.Количество() <> 0 Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Дата", НачалоДня(Дата)-1);
		Запрос.УстановитьПараметр("Клиенты", ЗавершаемыеНазначения.ВыгрузитьКолонку("Пациент"));
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыполнениеДействийСтационара.ИдентификаторЭлемента КАК ИдентификаторДействия,
		|	ВыполнениеДействийСтационара.Клиент,
		|	СУММА(ВыполнениеДействийСтационара.Количество) КАК Количество,
		|	ВыполнениеДействийСтационара.Документ КАК ДокументИзмененияРежима
		|ИЗ
		|	РегистрСведений.ВыполнениеДействийСтационара КАК ВыполнениеДействийСтационара
		|ГДЕ
		|	ВыполнениеДействийСтационара.ДатаВремяВыполнения <= &Дата
		|	И ВыполнениеДействийСтационара.Клиент В(&Клиенты)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыполнениеДействийСтационара.ИдентификаторЭлемента,
		|	ВыполнениеДействийСтационара.Клиент,
		|	ВыполнениеДействийСтационара.Документ"
		;
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			мсСтр = ЗавершаемыеНазначения.НайтиСтроки(Новый Структура("ИдентификаторДействия, Пациент", Выборка.ИдентификаторДействия, Выборка.Клиент));
			Для Каждого СтрокаНазначния Из мсСтр Цикл
				СтрокаНазначния.ОстатосьВыполнить = СтрокаНазначния.ВсегоНазначено - Выборка.Количество;	
			КонецЦикла;												
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ЗавершаемыеНазначения;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСтруктуруОтбора()
	
	Если ТипЗнч(СтруктураОтбора) <> Тип("Структура") Тогда 
		СтруктураОтбора = Новый Структура;
	Иначе 
		СтруктураОтбора.Очистить();
	КонецЕсли;
	
	Для Каждого ЭлементФормы Из Элементы.ГруппаОтборы.ПодчиненныеЭлементы Цикл 
		Если ТипЗнч(ЭлементФормы) <> Тип("КнопкаФормы")
			И ЗначениеЗаполнено(ЭтотОбъект[ЭлементФормы.Имя]) 
			И ЭлементФормы.Имя <> "ДатаПросмотра" 
			И ЭлементФормы.Имя <> "ПоказыватьПоПациентам"
		Тогда 
			СтруктураОтбора.Вставить(ЭлементФормы.Имя, ЭтотОбъект[ЭлементФормы.Имя]);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ДействиеСтационараПриИзменении(Элемент)
	ЗаполнитьСписокДействий();
КонецПроцедуры

&НаКлиенте
Процедура ПациентПриИзменении(Элемент)
	
	Если	ЗначениеЗаполнено(Пациент) И Не ПоказыватьПоПациентам
		Или Не ЗначениеЗаполнено(Пациент) И ПоказыватьПоПациентам
	Тогда
		ПоказыватьПоПациентам(Неопределено);
	КонецЕсли;
	
	ЗаполнитьСписокДействий();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтрокуСортировки()
	
	СтрокаСортировки = "";
	
	Для Каждого эл Из Элементы.ГруппаСортировки.ПодчиненныеЭлементы Цикл 
		Если ЭтаФорма[эл.Имя] Тогда 
			СтрокаСортировки = СтрокаСортировки + СтрЗаменить(эл.Имя,"Сортировка","") + ",";		
		КонецЕсли;
	КонецЦикла;
	Если СтрДлина(СтрокаСортировки) > 0 Тогда 
		СтрокаСортировки = СокрЛП(СтрЗаменить(СтрокаСортировки + ")",",)",""));
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СортировкаВидДействияПриИзменении(Элемент)
	ЗаполнитьСписокДействий();
КонецПроцедуры

&НаКлиенте
Процедура СортировкаДействиеСтационараПриИзменении(Элемент)
	ЗаполнитьСписокДействий();
КонецПроцедуры

&НаКлиенте
Процедура СортировкаПациентПриИзменении(Элемент)
	ЗаполнитьСписокДействий();
КонецПроцедуры

&НаСервереБезконтекста
Функция ПолучитьКомментарийКлиента(Клиент)
	
	Выб = РегистрыСведений.ДополнительнаяИнформацияПоКлиентам.Выбрать(Новый Структура("Клиент",Клиент));
	Если Выб.Следующий() Тогда 
		Возврат Выб.ПолучитьМенеджерЗаписи().Комментарий;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОтменитьВыполнение(Команда)
	
	ТекущиеДанные = Элементы.СписокДействий.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущаяСтрока = Элементы.СписокДействий.ТекущаяСтрока;
		ПараметрыФормы = Новый Структура("ДатаВыполнения,ИдентификаторЭлемента", ДатаПросмотра,Новый УникальныйИдентификатор(ТекущиеДанные.ИдентификаторДействия));
		ФормаДанныеВыполнения = ПолучитьФорму("Документ.ДействияЗаСутки.Форма.ФормаПросмотраДействий",ПараметрыФормы);
		ФормаДанныеВыполнения.ОткрытьМодально();
		ЗаполнитьСписокДействийКЭШ();
		ЗаполнитьСписокДействий();
		
		Элементы.СписокДействий.ТекущаяСтрока = ТекущаяСтрока;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКомментарий(Команда)
	
	Если ПоказыватьПоПациентам Тогда 
		Клиент = Пациент;
	Иначе  
		Клиент = Элементы.СписокДействий.ТекущиеДанные.Пациент;
	КонецЕсли;	
	
	ПараметрыФормы = Новый Структура("Клиент",Клиент);

	ФормаКомментария = ПолучитьФорму("РегистрСведений.ДополнительнаяИнформацияПоКлиентам.ФормаЗаписи",ПараметрыФормы);	
	ФормаКомментария.ОткрытьМодально();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПервичныйПрием(ДокументИзмененияРежима)
	
	Если ТипЗнч(ДокументИзмененияРежима) = Тип("ДокументСсылка.Прием") Тогда 
		ПервичныйПрием = ДокументИзмененияРежима.ПервичныйПрием;
	ИначеЕсли ТипЗнч(ДокументИзмененияРежима) = Тип("ДокументСсылка.ИзменениеРежима") Тогда 
		ПервичныйПрием = ДокументИзмененияРежима.ДокументОснование.ПервичныйПрием;
	Иначе 
		ПервичныйПрием = Документы.Прием.ПустаяСсылка();
	КонецЕсли;
	
	Возврат ПервичныйПрием;
	
КонецФункции

&НаКлиенте
Процедура КомментарийПоКлиентуПриИзменении(Элемент)
	
	Если ПоказыватьПоПациентам Тогда 
		Клиент = Элементы.СписокПациентов.ТекущиеДанные.Пациент;
	Иначе 
		Клиент = Элементы.СписокДействий.ТекущиеДанные.Пациент;
	КонецЕсли;
	
	Если Клиент <> Неопределено Тогда 
		КомментарийПоКлиентуПриИзмененииСервер(Клиент,КомментарийПоПациенту);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура КомментарийПоКлиентуПриИзмененииСервер(Клиент,КомментарийПоПациенту)
	
	НаборЗаписей = РегистрыСведений.ДополнительнаяИнформацияПоКлиентам.Выбрать(Новый Структура("Клиент",Клиент));
	
	Если НаборЗаписей.Следующий() Тогда 
		ЗаписьРегистра = НаборЗаписей.ПолучитьМенеджерЗаписи();
       	Если СокрЛП(КомментарийПоПациенту) <> "" Тогда 
			ЗаписьРегистра.Комментарий = КомментарийПоПациенту;
			ЗаписьРегистра.Записать(Истина);
		Иначе 
			ЗаписьРегистра.Удалить();
		КонецЕсли;
	Иначе 
	    ЗаписьРегистра = РегистрыСведений.ДополнительнаяИнформацияПоКлиентам.СоздатьМенеджерЗаписи();
	    ЗаписьРегистра.Период = ТекущаяДата();
	    ЗаписьРегистра.Клиент = Клиент;
	    ЗаписьРегистра.Комментарий = КомментарийПоПациенту;
		ЗаписьРегистра.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДействийПриАктивизацииСтроки(Элемент)
	
	Если СписокДействий.Количество() > 0 Тогда 
		КомментарийПоПациенту = ПолучитьКомментарийКлиента(Элементы.СписокДействий.ТекущиеДанные.Пациент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДействийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьХронологиюВыполненияДействия();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьХронологиюВыполненияДействия1(Команда)
	
	ОткрытьХронологиюВыполненияДействия();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьХронологиюВыполненияДействия()
	
	ТекущиеДанные = Элементы.СписокДействий.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		ПараметрыФормы = Новый Структура("ДатаВыполнения,ИдентификаторЭлемента", ДатаПросмотра,Новый УникальныйИдентификатор(ТекущиеДанные.ИдентификаторДействия));
		ПараметрыФормы.Вставить("СкрытьКомандуУдаления", Истина);
		ОткрытьФорму("Документ.ДействияЗаСутки.Форма.ФормаПросмотраДействий",ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста 
Функция ЭтоДействиеТемпературногоЛиста(ДействиеСтационара) Экспорт

	Возврат ТипЗнч(ДействиеСтационара) = Тип("СправочникСсылка.ДействияМедсестрыСтационара") И ДействиеСтационара.Предопределенный;
		
КонецФункции

&НаСервере
Процедура ОтметитьВыполнениеТЛНаСервере(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Результат.Результат) = Тип("Массив") И Результат.Результат.Количество() > 0 Тогда
		ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
		
		// Создаем документ ДействияЗаСутки
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДействияЗаСутки.Ссылка
		|ИЗ
		|	Документ.ДействияЗаСутки КАК ДействияЗаСутки
		|ГДЕ
		|	Не ДействияЗаСутки.ПометкаУдаления
		|	И ДействияЗаСутки.Ответственный = &Ответственный
		|	И ДействияЗаСутки.Филиал = &Филиал
		|	И НАЧАЛОПЕРИОДА(ДействияЗаСутки.Дата,ДЕНЬ) = &Дата");
		
		Запрос.УстановитьПараметр("Филиал",Филиал);
		Запрос.УстановитьПараметр("Ответственный", ТекущийПользователь);
		Запрос.УстановитьПараметр("Дата", НачалоДня(Результат.Данные.Дата));
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Не Выборка.Следующий() Тогда 
			ДействияЗаСуткиОбъект = Документы.ДействияЗаСутки.СоздатьДокумент();
			ДействияЗаСуткиОбъект.Дата			 = Результат.Данные.Дата;
			ДействияЗаСуткиОбъект.Филиал         = Филиал;
			ДействияЗаСуткиОбъект.Ответственный	 = ТекущийПользователь;
		Иначе 
			ДействияЗаСуткиОбъект = Выборка.Ссылка.ПолучитьОбъект();
		КонецЕсли;
		
		Для Каждого ДействиеМедсестрыСтационара Из Результат.Результат Цикл
			
			// Отбор и перезапись старых
			Отбор = Новый Структура("Клиент, МедицинскаяКарта, ИдентификаторЭлемента, ДатаВремяВыполнения");
			Отбор.ИдентификаторЭлемента = ДействиеМедсестрыСтационара.ИдентификаторЭлемента;
			ЗаполнитьЗначенияСвойств(Отбор, ДополнительныеПараметры);
			ЗаполнитьЗначенияСвойств(Отбор, ДействиеМедсестрыСтационара);
			Отбор.ДатаВремяВыполнения = Результат.Данные.Дата;
			
			МсСтрокиВыполнения = ДействияЗаСуткиОбъект.ДействияСтационара.НайтиСтроки(Отбор);
			Если МсСтрокиВыполнения.Количество() = 0 Тогда
				стрДействий = ДействияЗаСуткиОбъект.ДействияСтационара.Добавить();
			Иначе
				стрДействий = МсСтрокиВыполнения[0];
				ДействиеМедсестрыСтационара.ЭтоПерезапись = Истина;
			КонецЕсли;
			стрДействий.ВидыДействийСтационара = Перечисления.ВидыДействийСтационара.Манипуляции;
			ЗаполнитьЗначенияСвойств(стрДействий, ДополнительныеПараметры);
			ЗаполнитьЗначенияСвойств(стрДействий, ДействиеМедсестрыСтационара);			
			стрДействий.ДатаВремяВыполнения = Результат.Данные.Дата; // + ?(Результат.Данные.ЭтоВечер, 54000, 0); // вечер - в 15:00 проставится
			СтрДействий.ЭтоВечер = Результат.Данные.ЭтоВечер;
			стрДействий.ДействиеСтационара = Справочники.ДействияМедсестрыСтационара[ДействиеМедсестрыСтационара.Ключ];
			стрДействий.Значение = ДействиеМедсестрыСтационара.Значение;
		КонецЦикла; 				
		
		Попытка
			ДействияЗаСуткиОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
			Для Каждого ДействиеМедсестрыСтационара Из Результат.Результат Цикл
				Если Не ДействиеМедсестрыСтационара.ЭтоПерезапись Тогда
					СтрокаДействие = СписокДействий.НайтиСтроки(Новый Структура("ИдентификаторДействия",(ДействиеМедсестрыСтационара.ИдентификаторДействия)));
					ТекущиеДанные = СтрокаДействие[0];
					ТекущиеДанные.Выполнено = ТекущиеДанные.Выполнено + 1;
					СтрокаКЭШ = СписокДействийКэш.НайтиСтроки(Новый Структура("ИдентификаторДействия",ТекущиеДанные.ИдентификаторДействия));
					
					Если ДатаПросмотра = НачалоДня(Результат.Данные.Дата) Тогда
						ТекущиеДанные.ВыполненоИтог = Строка(ТекущиеДанные.Выполнено) + "/" + Строка(ТекущиеДанные.РазВДень);
					КонецЕсли;
					
					Если ТекущиеДанные.Выполнено >= ТекущиеДанные.РазВДень Тогда 
						ТекущиеДанные.ОтметкаВыполнения = Истина;
					КонецЕсли;
					
					Если СтрокаКЭШ.Количество() > 0 Тогда 
						СтрокаКЭШ[0].Выполнено = ТекущиеДанные.Выполнено;
						СтрокаКЭШ[0].ВыполненоИтог = ТекущиеДанные.ВыполненоИтог;
						СтрокаКЭШ[0].ОтметкаВыполнения = ТекущиеДанные.ОтметкаВыполнения;
					КонецЕсли;
				КонецЕсли;			
			КонецЦикла;
		Исключение
		КонецПопытки;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТемпературныйЛист(Команда)
	
	ТекущиеДанные = Элементы.СписокПациентов.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		
		СтруктураДанных = Новый Структура();
		СтруктураДанных.Вставить("Клиент", ТекущиеДанные.Пациент);
		СтруктураДанных.Вставить("МедицинскаяКарта",ТекущиеДанные.МедицинскаяКарта);
		СтруктураДанных.Вставить("ДатаПросмотра", ДатаПросмотра);		
		
		СоответствиеДействияСтационара = Новый Соответствие;
		
		СтруктураОтбора = Новый Структура("Пациент, ВидДействия", ТекущиеДанные.Пациент, ПредопределенноеЗначение("Перечисление.ВидыДействийСтационара.Манипуляции"));	
		МсСтрокиДействияПациента = СписокДействий.НайтиСтроки(СтруктураОтбора);
		Для каждого СтрокаДействияПациента Из МсСтрокиДействияПациента Цикл
			Если СоответствиеДействияСтационара.Получить(СтрокаДействияПациента.ДействиеСтационара) = Неопределено Тогда
				СоответствиеДействияСтационара.Вставить(СтрокаДействияПациента.ДействиеСтационара, 
																Новый Структура("ИдентификаторДействия, ДокументИзмененияРежима", 
																СтрокаДействияПациента.ИдентификаторДействия, СтрокаДействияПациента.ДокументИзмененияРежима));
			КонецЕсли;
		КонецЦикла;
		СтруктураДанных.Вставить("НазначенныеДействия", СоответствиеДействияСтационара);
		ФормаВводаЗначения = ПолучитьФорму("ОбщаяФорма.ТемпературныйЛистВводПоказателей", СтруктураДанных);
		ОткрытьФорму("ОбщаяФорма.ТемпературныйЛистВводПоказателей",СтруктураДанных,,,,, Новый ОписаниеОповещения("ОтметитьВыполнениеТЛНаСервере", ЭтаФорма, СтруктураДанных));	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗабор(Команда)
	Если ЗначениеЗаполнено(Пациент) Тогда
		Клиент = Пациент;
	Иначе
		Попытка
			Клиент = Элементы.СписокДействий.ТекущиеДанные.Пациент;	
		Исключение
		    ПоказатьПредупреждение(,НСтр("ru='Не выбран пациент!'"), 30);
		КонецПопытки;
	КонецЕсли;
	ПараметрыОтбора = Новый Структура("Пациент",Клиент);
	ДействияКлиента = СписокДействий.НайтиСтроки(ПараметрыОтбора);
	ПараметрАнализы = Новый Массив;
	Для Каждого СтрокаДействия Из ДействияКлиента Цикл
		Если ТипЗнч(СтрокаДействия.ДействиеСтационара) = Тип("СправочникСсылка.Номенклатура")
			И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаДействия.ДействиеСтационара,"Анализ")
			И Не СтрокаДействия.ОтметкаВыполнения
			И СтрокаДействия.РазВДень > СтрокаДействия.Выполнено
		Тогда
			ПараметрАнализы.Добавить(Новый Структура("Клиент, Номенклатура, Количество",Клиент,СтрокаДействия.ДействиеСтационара, 1));
		КонецЕсли; 	
	КонецЦикла;
	
	Если ПараметрАнализы.Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru='Нет невыполенных анализов у пациента!'"), 30);
	ИначеЕсли ПараметрАнализы.Количество() = 1 Тогда
		// Сразу открываем документ забора, т.к. не нужно выбирать из единственного варианта.
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения",
			Новый Структура("Клиент, Анализы, ВидОперации", Клиент, ПараметрАнализы	, ПредопределенноеЗначение("Перечисление.ВидыОперацийАнализов.Забор")));
		ОткрытьФорму("Документ.ДействияНадАнализами.ФормаОбъекта", ПараметрыФормы, ЭтаФорма.ВладелецФормы);
	Иначе
		РаботаСКлиентамиКлиентПереопределяемый.ВыборатьУслугиКлиентовДляСозданияДокумента("Забор", Клиент, ПараметрАнализы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНазначения(Команда = Неопределено)
	
	Состояние("Обновление пациентов и назначений");
	ОбновитьНазначенияНаСервере();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНазначенияОбработчикОжидания()
	
	ОбновитьНазначения();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНазначенияНаСервере() Экспорт
	
	ЗаполнитьСписокПациентов();
	ЗаполнитьСписокДействийКЭШ();
	ЗаполнитьСписокДействий();	
	
КонецПроцедуры

&НаКлиенте
Процедура омг_ФилиалыНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;//("Организация", Объект.омг_Организация);
	СписокВыбранных = омг_Филиалы;
	ОткрытьФорму("ОбщаяФорма.омг_ФормаВыбораСИерархией", 
		Новый Структура("Справочник, СписокВыбранных, Отбор", "Филиалы", СписокВыбранных, Отбор), Элементы.омг_Филиалы,
		УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура омг_ОтделенияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокВыбранных = омг_Отделения;

	Отбор = Новый Структура;//("Организация", Объект.омг_Организация);
	
	ПараметрыЗапроса = Новый Массив;
	ПараметрыЗапроса.Добавить(Новый Структура("Параметр, Значение", "Филиалы", омг_Филиалы.ВыгрузитьЗначения()));
	
	Отбор.Вставить("ПараметрыЗапроса", ПараметрыЗапроса);
	
	СложныеОтборы = Новый Массив;
	Если Не омг_Филиалы.Количество() = 0 Тогда
		СложныеОтборы.Добавить("Филиал В (&Филиалы)");
	КонецЕсли;
	
	Отбор.Вставить("СложныеОтборы", СложныеОтборы);
	ОткрытьФорму("ОбщаяФорма.омг_ФормаВыбораСИерархией", 
		Новый Структура("Справочник, СписокВыбранных, Отбор", "Подразделения", СписокВыбранных, Отбор), Элементы.омг_Отделения,
		УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура омг_ФилиалыОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	омг_Филиалы = ВыбранноеЗначение;
	
	ОбновитьНазначенияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура омг_ОтделенияОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	омг_Отделения = ВыбранноеЗначение;
	
	ОбновитьНазначенияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура омг_ФилиалыПриИзменении(Элемент)
	
	Если Не омг_Филиалы.Количество() = 0 Тогда
		омг_Отделения.Очистить();
	КонецЕсли;
	ОбновитьНазначенияНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура омг_ОтделенияПриИзменении(Элемент)

	ОбновитьНазначенияНаСервере();

КонецПроцедуры
